Exercises

For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

Has the network latency gone up since we switched internet service providers?

population: all devices connected to company's internet service.

sample: all devices in the data science department

H0: there is no change in latency when switching internet providers

H1: there is a increase in latency when switching internet providers

confidence interval(B): .95

significance level(a): 1 - B = .05

p-value: if p-value < a then reject H0
         else fail to reject H0   

true positive: H0 is false, reject H0

true negative: H0 is true, fail to reject H0

type I error (false positive): rejected H0, but should have failed to reject H0

type II error(false negative): failed to reject H0, but should have rejected H0

Is the website redesign any good?

new question: Is there a change in the amount of customer visits when the website is redesigned?

population: all tab and menu option links within the company's website

sample: homepage of the company's website

H0: there is no a change in the amount of customer visits when the website is redesigned

H1: there is a greater amount of customer visits when the website is redesigned

confidence interval(B): .99

significance level(a): 1 - B = .01

p-value: if p < a then reject H0
         else fail to reject H0   

true positive: H0 is false, reject H0

true negative: H0 is true, fail to reject H0

type I error (false positive): rejected H0, but should have failed to reject H0

type II error(false negative): failed to reject H0, but should have rejected H0

Is our television ad driving more sales?

new question: Do television ads drive more sales than social media ads?

population: all ads produced by a company

sample: television and social media ads in the past year

H0: there is no difference in sales between television and social media ads

H1: social media ads drive more sales

confidence interval(B): .99

significance level(a): 1 - B = .01

p-value: if p < a then reject H0
         else fail to reject H0   

true positive: H0 is false, reject H0

true negative: H0 is true, fail to reject H0

type I error (false positive): rejected H0, but should have failed to reject H0

type II error(false negative): failed to reject H0, but should have rejected H0

Exercises 2

Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

they are dependent. macbook users more likely to be a code up student.

H0: mac ownership affects student status

H1: mac ownership does not affect student status

In [129]:
m = np.array([[49, 20],
       [1, 30]])
chi, p , degf, exp = stats.chi2_contingency(m)

In [130]:
p

1.4116760526193828e-09

In [131]:
a = .05
if p < a:
    print('we reject to null hypothesis. appears to have relationship')
else:
    print('we fail to reject the null hypothesis')

we reject to null hypothesis. appears to have relationship

Choose another 2 categorical variables from the mpg dataset.

In [2]:
import numpy as np
import pandas as pd

from pydataset import data
from scipy import stats

In [3]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [17]:
mpg['hwy_mpg'] = pd.qcut(mpg.hwy, 2, labels = ['high_hwy', 'low_hwy'] )

In [37]:
mpg['trans_type'] = np.where(mpg.trans.str.startswith('a'), 'auto', 'manual')

In [46]:
ct = pd.crosstab(mpg.trans_type, mpg.hwy_mpg)
ct

hwy         high_hwy  low_hwy
trans_type
auto              93       64
manual            25       52

State your null and alternative hypotheses.

H0: transmission does not affect highway mpg

H1: transmission does affect highway mpg

State your alpha.

In [42]:
a = .05

Perform a 
c
h
i
2
 test of indepedence.

In [45]:
chi, p , degf, exp = stats.chi2_contingency(ct)
p

0.00020807042407273567

In [44]:
a = .05
if p < a:
    print('we reject to null hypothesis. appears to have relationship')
else:
    print('we fail to reject the null hypothesis')

we reject to null hypothesis. appears to have relationship

Use the data from the employees database to answer these questions:

In [48]:
from sqlalchemy import text, create_engine

from env import get_connection

In [53]:
url = get_connection('employees')

In [54]:
engine = create_engine(url)

In [105]:
query = '''
        SELECT *
        FROM employees
        INNER JOIN dept_emp ON dept_emp.emp_no = employees.emp_no
        INNER JOIN departments ON dept_emp.dept_no = departments.dept_no
        '''

In [106]:
text_query= text(query)

In [107]:
df = pd.read_sql(text_query, engine.connect())
df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date,dept_no,dept_name
0,10011,1953-11-07,Mary,Sluis,F,1990-01-22,10011,d009,1990-01-22,1996-11-09,d009,Customer Service
1,10038,1960-07-20,Huan,Lortz,M,1989-09-20,10038,d009,1989-09-20,9999-01-01,d009,Customer Service
2,10049,1961-04-24,Basil,Tramer,F,1992-05-04,10049,d009,1992-05-04,9999-01-01,d009,Customer Service
3,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,10060,d009,1992-11-11,9999-01-01,d009,Customer Service
4,10088,1954-02-25,Jungsoon,Syrzycki,F,1988-09-02,10088,d009,1992-03-21,9999-01-01,d009,Customer Service

Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

In [83]:
sm = df[(df.dept_name == 'Sales') | (df.dept_name == 'Marketing')]
sm

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date,dept_no,dept_name
144419,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,10017,d001,1993-08-03,9999-01-01,d001,Marketing
144420,10055,1956-06-06,Georgy,Dredge,M,1992-04-27,10055,d001,1992-04-27,1995-07-22,d001,Marketing
144421,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,10058,d001,1988-04-25,9999-01-01,d001,Marketing
144422,10108,1952-04-07,Lunjin,Giveon,M,1986-10-02,10108,d001,1999-12-06,2001-10-20,d001,Marketing
144423,10140,1957-03-11,Yucel,Auria,F,1991-03-14,10140,d001,1991-03-14,9999-01-01,d001,Marketing
...,...,...,...,...,...,...,...,...,...,...,...,...
331598,499976,1963-08-20,Guozhong,Felder,M,1988-12-26,499976,d007,1988-12-26,9999-01-01,d007,Sales
331599,499980,1959-06-28,Gino,Usery,M,1991-02-11,499980,d007,1991-02-11,9999-01-01,d007,Sales
331600,499986,1952-07-22,Nathan,Ranta,F,1985-08-11,499986,d007,1985-08-11,9999-01-01,d007,Sales
331601,499987,1961-09-05,Rimli,Dusink,F,1998-09-20,499987,d007,1999-12-21,9999-01-01,d007,Sales
331602,499988,1962-09-28,Bangqing,Kleiser,F,1986-06-06,499988,d007,1988-07-25,2001-10-09,d007,Sales

In [87]:
sm = sm[sm.to_date == sm.to_date.max()]

In [77]:
df.dept_name == 'Marketing'

0         False
1         False
2         False
3         False
4         False
          ...
331598    False
331599    False
331600    False
331601    False
331602    False
Name: dept_name, Length: 331603, dtype: bool

In [132]:
c = pd.crosstab(sm.gender, sm.dept_name)
c

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [134]:
chi, p , degf, exp = stats.chi2_contingency(c)

In [135]:
p

0.5691938610810126

In [136]:
a = .05
if p < a:
    print('we reject to null hypothesis. appears to have relationship')
else:
    print('we fail to reject the null hypothesis. appears to have no relationship')

we fail to reject the null hypothesis. appears to have no relationship

Is an employee's gender independent of whether or not they are or have been a manager?

In [108]:
query2 = '''
        SELECT *
        FROM employees
        INNER JOIN dept_manager ON employees.emp_no = dept_manager.emp_no
        '''

In [109]:
text_query2 = text(query2)

In [110]:
df = pd.read_sql(text_query2, engine.connect())
df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,from_date,to_date
0,110022,1956-09-12,Margareta,Markovitch,M,1985-01-01,110022,d001,1985-01-01,1991-10-01
1,110039,1963-06-21,Vishwani,Minakawa,M,1986-04-12,110039,d001,1991-10-01,9999-01-01
2,110085,1959-10-28,Ebru,Alpin,M,1985-01-01,110085,d002,1985-01-01,1989-12-17
3,110114,1957-03-28,Isamu,Legleitner,F,1985-01-14,110114,d002,1989-12-17,9999-01-01
4,110183,1953-06-24,Shirish,Ossenbruggen,F,1985-01-01,110183,d003,1985-01-01,1992-03-21

In [120]:
all_mgrs = df.from_date <= df.from_date.max()

In [121]:
all_mgrs.value_counts()

True    24
Name: from_date, dtype: int64

In [127]:
ctt = pd.crosstab(df.gender, all_mgrs)
ctt

from_date  True
gender
F            13
M            11

In [124]:
chi, p , degf, exp = stats.chi2_contingency(ctt)

In [126]:
p

1.0

In [128]:
a = .05
if p < a:
    print('we reject to null hypothesis. appears to have relationship')
else:
    print('we fail to reject the null hypothesis. appears to have no relationship')

we fail to reject the null hypothesis. appears to have no relationship